* Grammarly

I need Keytar to log in.

#+begin_src emacs-lisp
(use-package keytar
  :ensure t
)

(use-package lsp-grammarly
  :ensure t
  :hook (text-mode . (lambda ()
                       (require 'lsp-grammarly)
                       (lsp))))  ; or lsp-deferred
#+end_src

#+RESULTS:
| (lambda nil (require 'lsp-grammarly) (lsp)) | text-mode-hook-identify |

